app/controllers/api/v1/diets_controller.rb

    def index
        diets = Diet.all
---
SELECT "diets".* FROM "diets"

    def show
        diet = Diet.find(params[:id])
---
SELECT "diets".* FROM "diets" WHERE "diets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]