app/controllers/api/v1/recipe_diets_controller.rb

SELECT "recipe_diets".* FROM "recipe_diets"
---
    def index
        recipediets = RecipeDiet.all

SELECT "diets".* FROM "diets" WHERE "diets"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "recipe_diets".* FROM "recipe_diets" WHERE "recipe_diets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        recipediet = RecipeDiet.find(params[:id])

INSERT INTO "recipe_diets" ("recipe_id", "diet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 30], ["diet_id", 8], ["created_at", "2020-07-29 17:39:08.337644"], ["updated_at", "2020-07-29 17:39:08.337644"]]
---
    def create
        recipediet = RecipeDiet.create(recipediet_params)