app/controllers/api/v1/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
        def show
            recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("name", "ingredients", "instructions", "image_url", "created_at", "updated_at", "done_tagging") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
        def create
            recipe = Recipe.create(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
        def edit
            recipe = Recipe.find(params[:id])

UPDATE "recipes" SET "done_tagging" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["done_tagging", true], ["updated_at", "2020-08-03 21:26:38.962805"], ["id", 44]]
---
        def update
            recipe = Recipe.update(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 56]]
---
        def destroy
            recipe = Recipe.find(params[:id])
            recipe.destroy